Revit 2024 API
CurveArrayIterator Properties
The CurveArrayIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
See Also
CurveArrayIterator Class
Autodesk.Revit.DB Namespace